*** Production data retrieval
The first thing that is required is to get all the necessary data from the
current production processing.  I don't have access to DWR's data, but I
retrieved data from the UC Davis processing network.  To test the new (cloud)
based processing, we need to keep all the interpolated data the same, and drop
in replace the solar data.  So, I need to get a subset of the cimis data for
each day.  I created r.pack files for all the required data on Davis server.
The code for that looks like this:

You can see that I gave a 14 day startup time, so that starting on 2023-01-04,
when goes-18 went live, we had enough of a window for processing.

#+begin_src bash
  # One the UC Davis server, in grass
  vars='ea  es  ETo  K  Rnl  Rso  Rs  Tm  Tx  U2 Tn'
  for d in $(seq 0 655); do
      ymd=$(date --date="2022-12-20 + $d days" +%Y%m%d);
      for i in $vars; do
          echo $i@$ymd;
          r.pack --quiet input=$i@$ymd output=$ymd/$i.pack
      done;
      # Vectors as well
      for i in et z_normal; do
          v.pack input=$i@$ymd output=$ymd/$i.pack;
  done;
#+end_src

I then uploaded this data to a new project in google cloud.  The project
identifer is ~dwr-spatial-cimis~.  All in all this is about 85G of data.

#+begin_src bash
    gcloud config configurations list
    # shows
    #NAME               IS_ACTIVE  ACCOUNT             PROJECT              COMPUTE_DEFAULT_ZONE  COMPUTE_DEFAULT_REGION
    #dwr-spatial-cimis  True       qjhart@gmail.com    dwr-spatial-cimis
#+end_src

The packed data is located at ~gs://dwr-cimis-pack~.  Once you have the access
to this project, you can see the data with:

#+begin_src bash
  gsutil ls gs://dwr-cimis-pack
#+end_src

#+RESULTS:
| gs://dwr-cimis-pack/cimis-cloud/ |
| gs://dwr-cimis-pack/cimis-dish/  |

and you can fetch all the data for processing with:

#+begin_src bash
  gsutil -m rsync -r gs://dwr-cimis-pack/cimis-dish cimis-dish
#+end_src

